spec/fixtures/pos_gateway2.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="http://Hps.Exchange.PosGateway" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" targetNamespace="http://Hps.Exchange.PosGateway" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <s:schema targetNamespace="http://Hps.Exchange.PosGateway">
      <s:include schemaLocation="https://posgateway.cert.secureexchange.net/Hps.Exchange.PosGateway.UAT/PosGatewayService.asmx?schema=schema1"/>
    </s:schema>
  </wsdl:types>
  <wsdl:message name="DoTransactionSoapIn">
    <wsdl:part name="PosRequest" element="tns:PosRequest"/>
  </wsdl:message>
  <wsdl:message name="DoTransactionSoapOut">
    <wsdl:part name="DoTransactionResult" element="tns:PosResponse"/>
  </wsdl:message>
  <wsdl:portType name="PosGatewayInterface">
    <wsdl:operation name="DoTransaction">
      <wsdl:input message="tns:DoTransactionSoapIn"/>
      <wsdl:output message="tns:DoTransactionSoapOut"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="PosGatewayInterface" type="tns:PosGatewayInterface">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="DoTransaction">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:binding name="PosGatewayInterface1" type="tns:PosGatewayInterface">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="DoTransaction">
      <soap12:operation soapAction="" style="document"/>
      <wsdl:input>
        <soap12:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap12:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
</wsdl:definitions>